micropython/micropython/stmhal/cmsis/devinc/stm32f745xx.h
/********************  Bits definition for RTC_TAMPCR register  ****************/
#define RTC_TAMPCR_TAMP3MF                    ((uint32_t)0x01000000)
#define RTC_TAMPCR_TAMP3NOERASE               ((uint32_t)0x00800000)
#define RTC_TAMPCR_TAMP3IE                    ((uint32_t)0x00400000)
#define RTC_TAMPCR_TAMP2MF                    ((uint32_t)0x00200000)
#define RTC_TAMPCR_TAMP2NOERASE               ((uint32_t)0x00100000)
#define RTC_TAMPCR_TAMP2IE                    ((uint32_t)0x00080000)
#define RTC_TAMPCR_TAMP1MF                    ((uint32_t)0x00040000)
#define RTC_TAMPCR_TAMP1NOERASE               ((uint32_t)0x00020000)
#define RTC_TAMPCR_TAMP1IE                    ((uint32_t)0x00010000)
#define RTC_TAMPCR_TAMPPUDIS                  ((uint32_t)0x00008000)
#define RTC_TAMPCR_TAMPPRCH                   ((uint32_t)0x00006000)
#define RTC_TAMPCR_TAMPPRCH_0                 ((uint32_t)0x00002000)
#define RTC_TAMPCR_TAMPPRCH_1                 ((uint32_t)0x00004000)
#define RTC_TAMPCR_TAMPFLT                    ((uint32_t)0x00001800)
#define RTC_TAMPCR_TAMPFLT_0                  ((uint32_t)0x00000800)
#define RTC_TAMPCR_TAMPFLT_1                  ((uint32_t)0x00001000)
#define RTC_TAMPCR_TAMPFREQ                   ((uint32_t)0x00000700)
#define RTC_TAMPCR_TAMPFREQ_0                 ((uint32_t)0x00000100)
#define RTC_TAMPCR_TAMPFREQ_1                 ((uint32_t)0x00000200)
#define RTC_TAMPCR_TAMPFREQ_2                 ((uint32_t)0x00000400)
#define RTC_TAMPCR_TAMPTS                     ((uint32_t)0x00000080)
#define RTC_TAMPCR_TAMP3_TRG                  ((uint32_t)0x00000040)
#define RTC_TAMPCR_TAMP3E                     ((uint32_t)0x00000020)
#define RTC_TAMPCR_TAMP2_TRG                   ((uint32_t)0x00000010)
#define RTC_TAMPCR_TAMP2E                     ((uint32_t)0x00000008)
#define RTC_TAMPCR_TAMPIE                     ((uint32_t)0x00000004)
#define RTC_TAMPCR_TAMP1_TRG                   ((uint32_t)0x00000002)
#define RTC_TAMPCR_TAMP1E                     ((uint32_t)0x00000001)

/********************  Bits definition for RTC_ALRMASSR register  *************/
#define RTC_ALRMASSR_MASKSS                  ((uint32_t)0x0F000000)
#define RTC_ALRMASSR_MASKSS_0                ((uint32_t)0x01000000)
#define RTC_ALRMASSR_MASKSS_1                ((uint32_t)0x02000000)
#define RTC_ALRMASSR_MASKSS_2                ((uint32_t)0x04000000)
#define RTC_ALRMASSR_MASKSS_3                ((uint32_t)0x08000000)
#define RTC_ALRMASSR_SS                      ((uint32_t)0x00007FFF)

/********************  Bits definition for RTC_ALRMBSSR register  *************/
#define RTC_ALRMBSSR_MASKSS                  ((uint32_t)0x0F000000)
#define RTC_ALRMBSSR_MASKSS_0                ((uint32_t)0x01000000)
#define RTC_ALRMBSSR_MASKSS_1                ((uint32_t)0x02000000)
#define RTC_ALRMBSSR_MASKSS_2                ((uint32_t)0x04000000)
#define RTC_ALRMBSSR_MASKSS_3                ((uint32_t)0x08000000)
#define RTC_ALRMBSSR_SS                      ((uint32_t)0x00007FFF)

/********************  Bits definition for RTC_OR register  ****************/
#define RTC_OR_TSINSEL                      ((uint32_t)0x00000006)
#define RTC_OR_TSINSEL_0                    ((uint32_t)0x00000002)
#define RTC_OR_TSINSEL_1                    ((uint32_t)0x00000004)
#define RTC_OR_ALARMTYPE                    ((uint32_t)0x00000008)


/********************  Bits definition for RTC_BKP0R register  ****************/
#define RTC_BKP0R                            ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for RTC_BKP1R register  ****************/
#define RTC_BKP1R                            ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for RTC_BKP2R register  ****************/
#define RTC_BKP2R                            ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for RTC_BKP3R register  ****************/
#define RTC_BKP3R                            ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for RTC_BKP4R register  ****************/
#define RTC_BKP4R                            ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for RTC_BKP5R register  ****************/
#define RTC_BKP5R                            ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for RTC_BKP6R register  ****************/
#define RTC_BKP6R                            ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for RTC_BKP7R register  ****************/
#define RTC_BKP7R                            ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for RTC_BKP8R register  ****************/
#define RTC_BKP8R                            ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for RTC_BKP9R register  ****************/
#define RTC_BKP9R                            ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for RTC_BKP10R register  ***************/
#define RTC_BKP10R                           ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for RTC_BKP11R register  ***************/
#define RTC_BKP11R                           ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for RTC_BKP12R register  ***************/
#define RTC_BKP12R                           ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for RTC_BKP13R register  ***************/
#define RTC_BKP13R                           ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for RTC_BKP14R register  ***************/
#define RTC_BKP14R                           ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for RTC_BKP15R register  ***************/
#define RTC_BKP15R                           ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for RTC_BKP16R register  ***************/
#define RTC_BKP16R                           ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for RTC_BKP17R register  ***************/
#define RTC_BKP17R                           ((uint32_t)0xFFFFFFFF)

